Revit 2027 API
TaskDialogCommandLinkId Enumeration
 Enum to specify the Id of CommandLink.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum TaskDialogCommandLinkId
Public Enumeration TaskDialogCommandLinkId
public enum class TaskDialogCommandLinkId
type TaskDialogCommandLinkId
Members
Member name | Value | Description
CommandLink1 | 1,001 |  CommandLink1.
CommandLink2 | 1,002 |  CommandLink2.
CommandLink3 | 1,003 |  CommandLink3.
CommandLink4 | 1,004 |  CommandLink4.
See Also
Reference
Autodesk.Revit.UI Namespace